In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.5.0-cp310-cp310-win_amd64.whl (10.4 MB)
     ---------------------------------------- 10.4/10.4 MB 8.0 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in c:\programdata\anaconda3\envs\dm\lib\site-packages (from pandas) (1.23.3)
Collecting pytz>=2020.1
  Downloading pytz-2022.4-py2.py3-none-any.whl (500 kB)
     -------------------------------------- 500.8/500.8 kB 7.8 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\envs\dm\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\envs\dm\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.0 pytz-2022.4

In [2]:
import pandas as pd

In [3]:
pd

In [12]:
hipandas = pd.Series([1,2,3,4,5])
print(hipandas)            #顯示Series
print(hipandas.values)     #顯示值
print(hipandas.index)      #顯示索引

0    1
1    2
2    3
3    4
4    5
dtype: int64

[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [13]:
hipandas1 = pd.Series([5,6,7,8,9,10])
print(hipandas1)            #顯示Series
print(hipandas1.values)     #顯示值
print(hipandas1.index)      #顯示索引

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64
[ 5  6  7  8  9 10]
RangeIndex(start=0, stop=6, step=1)

In [14]:
dict1 = {'Taipei':'台北','Taichung':'台中','Kaohsiung':'高雄'}

In [15]:
dict1

{'Taipei': '台北', 'Taichung': '台中', 'Kaohsiung': '高雄'}

In [16]:
city = pd.Series(dict1)

In [18]:
print(city)   #顯示Series

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object

In [19]:
print(city.values)  #顯示值

['台北' '台中' '高雄']

In [20]:
print(city.index) #顯示索引

Index(['Taipei', 'Taichung', 'Kaohsiung'], dtype='object')

In [24]:
print(city['Taipei'])

台北

In [25]:
print(city['Taipei':'Kaohsiung'])

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object

In [28]:
print(city['Taichung':
           'Kaohsiung'])

Taichung     台中
Kaohsiung    高雄
dtype: object

In [29]:
hipandas[0]

1

In [31]:
hipandas1[2]

7

In [32]:
se1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [33]:
se1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [34]:
se1[1]

2

In [35]:
se1['b']

2

In [36]:
print(se1['a'],se1['b'],se1['c'],se1['d'],se1['e'])

1 2 3 4 5

In [37]:
df = pd.DataFrame([[13,41,51,24,52],
                   [15,25,23,46,59],
                   [64,67,57,86,97],
                   [37,38,48,58,69]])

In [38]:
df

    0   1   2   3   4
0  13  41  51  24  52
1  15  25  23  46  59
2  64  67  57  86  97
3  37  38  48  58  69

In [39]:
df1 = pd.DataFrame([[13,41,51,24,52],
                   [15,25,23,46,59],
                   [64,67,57,86,97],
                   [37,38,48,58,69]],
                   index=['王','李','陳','林'],
                   columns=['國','英','數','社','自'])

In [40]:
df1

    國   英   數   社   自
王  13  41  51  24  52
李  15  25  23  46  59
陳  64  67  57  86  97
林  37  38  48  58  69

In [41]:
scores={'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
        '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
        '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47}, 
        '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
        '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df2 = pd.DataFrame(scores)

In [42]:
df2

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [43]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df3 = pd.DataFrame({ '國文':se1,'英文':se2,'數學':se3,
                   '自然':se4,'社會':se5} )
df3

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [45]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df4 = pd.concat([se1,se2,se3,se4,se5], axis=1)
print(df4)
df4.columns=['國文','英文','數學','自然','社會']
df4

      0   1   2   3   4
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [46]:
df4['自然']

王小明    83
李小美    93
陳大同    89
林小玉    94
Name: 自然, dtype: int64

In [47]:
df4['數學']

王小明    78
李小美    76
陳大同    91
林小玉    47
Name: 數學, dtype: int64

In [48]:
df4['社會']

王小明    70
李小美    56
陳大同    94
林小玉    80
Name: 社會, dtype: int64

In [50]:
df4[['自然','數學','社會']]

     自然  數學  社會
王小明  83  78  70
李小美  93  76  56
陳大同  89  91  94
林小玉  94  47  80

In [51]:
df4[df4['國文'] >= 70]

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [52]:
df4[df4['數學'] >= 80]

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94

In [53]:
df4[df4['英文'] >= 90]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

In [54]:
df4[df4['國文'] <= 70]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

In [55]:
df4.loc["林小玉",'社會']

80

In [56]:
df4.loc["林小玉",['國文','社會']]

國文    79
社會    80
Name: 林小玉, dtype: int64

In [60]:
df4.loc["林小玉",'數學':'社會']

數學    47
自然    94
社會    80
Name: 林小玉, dtype: int64

In [61]:
df4.loc["李小美":,'數學':'社會']

     數學  自然  社會
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80

In [62]:
df4.loc[:"李小美",'數學':'社會']

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56